;; NIXOS
;;(package! nixos-options)
;;(package! helm-nixos-options)
;;(package! company-nixos-options)

;; MAJOR MODE
(package! zen-mode)
(package! command-log-mode)
(package! xwwp)

;; TEXT MODE
(package! perfect-margin)
(package! lorem-ipsum)
(package! org-bullets)
(package! figlet)

;; PRESENTATION
(package! ox-reveal)
(package! org-tree-slide)

;; ORG
;; (package! visual-fill-column)

(package! fast-scroll)
;; (package! origami)

(package! doom-themes)

(package! evil-better-visual-line)
(provide 'packages)

(package! github-search)

(package! exwm)
(package! wallpaper)
