#┌─────────────────────────────────────────────────────────────────────┐#
#│                                                                     │#
#│                          ▘    ▗     ニクソス ▜                      │#
#│                   ▛▌▛▘▛▌ ▌█▌▛▘▜▘  ▀▌▛▌▛▌▛▛▌▀▌▐ ▌▌                   │#
#│                   ▙▌▌ ▙▌ ▌▙▖▙▖▐▖  █▌▌▌▙▌▌▌▌█▌▐▖▙▌                   │#
#│                   ▌     ▙▌                     ▄▌                   │#
#│                                                                     │#
#│             ホームマネージャー      あのまりプロジェクト           │#
#│          NixOS configuration for reproducible linux system          │#
#│                                                                     │#
#│                                                                     │#
#└─────────────────────────────────────────────────────────────────────┘#
#                                                                  nxs  #

{ config, pkgs, ... }:

{
  imports = [
    ./arcana
    ./core
    ./regalia
    ./schema
  ];
  home-manager.users.archaict = import ./codex.nix;
}
